// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");
//Напишите программу, которая на вход принимает два числа и проверяет, является ли первое чило квадратом второго
// a = 25, b = 5 -> yes
// a = 2, b = 10 -> no
// a = 9, b = -3 -> yes
// a = -3, b = 9 -> no

int a = 25;
int b = 5;
if (a == b*b)
{
    Console.Write("YES");

}
else
{
    Console.Write("NO");
}

